app/views/users/myhome.html.erb


<%=
    @user = User.find_by_id(session[:user_logged_in])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1