app/views/posts/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
<%
   @user = User.find_by_id(session[:user_logged_in])