app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "votes".* FROM "votes" WHERE "votes"."post_id" = 1
---
  def show
    @post = Post.find(params[:id])
    votes = Vote.find_all_by_post_id(@post.id)

INSERT INTO "posts" ("category_id", "content", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["category_id", nil], ["content", "Hello World!!"], ["created_at", Tue, 01 Apr 2014 18:48:37 UTC +00:00], ["title", "Welcome"], ["updated_at", Tue, 01 Apr 2014 18:48:37 UTC +00:00], ["user_id", 2]]
---
  def create
    @post = Post.new(params[:post])
    @categories = Category.find_all_by_id(@post.category_id)
    @post.user_id = session[:user_logged_in]

    respond_to do |format|
      if @post.save

SELECT "posts".* FROM "posts" WHERE (content LIKE '%ssave%')
---
  def search
    @post = Post.search(params[:search],params[:search_by])