app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "fname", "lname", "password", "updated_at", "usertype") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])
    if session[:user_logged_in] != nil and User.find_by_id(session[:user_logged_in]).usertype == 1
      @user.usertype= 1
    else
      @user.usertype= 0
    end
    respond_to do |format|
      if @user.save