app/controllers/votes_controller.rb

  def index
    puts "Entered votes index"
    type = params[:type]
    id = params[:id]
    postid = params[:postid]
    if(type == "0")
      @votes = Vote.find_all_by_post_id(id)
    elsif type == "1"
      @votes = Vote.find_all_by_comment_id(id)
---
SELECT "votes".* FROM "votes" WHERE "votes"."post_id" = 1
SELECT "votes".* FROM "votes" WHERE "votes"."comment_id" = 2

  def create
    @vote = Vote.new(params[:vote])
    @vote.user_id = session[:user_logged_in]
    type = params[:type]

    if type == '0'
      @vote.post_id = params[:id]
    end
    if type == '1'
      @vote.comment_id = params[:id]
    end

    @posts = Post.find_all_by_id(params[:postid])
    if type == '0'
      votes = Vote.find_all_by_post_id(params[:id])
    elsif type == '1'
      votes = Vote.find_all_by_comment_id(params[:id])
    end
    userid = session[:user_logged_in]
    userpresent = false
    votes.each do |vote|
      if vote.user_id == userid
        userpresent = true
        break
      end
    end
    voteforself = false
    if type == '0'
      voteforself = session[:user_logged_in] == User.find_by_id(Post.find_by_id(params[:id]).user_id).id
    elsif type == '1'
      voteforself =  session[:user_logged_in] ==  User.find_by_id(Comment.find_by_id(params[:id]).user_id).id
---
SELECT "votes".* FROM "votes" WHERE "votes"."post_id" = 2
SELECT "votes".* FROM "votes" WHERE "votes"."comment_id" = 2
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 2 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "comments".* FROM "comments" WHERE "comments"."id" = 2 LIMIT 1


         displaystring = "You have already voted!"
    elsif userpresent == false and voteforself == false
      @vote.save
---
INSERT INTO "votes" ("comment_id", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["comment_id", nil], ["created_at", Tue, 01 Apr 2014 18:57:25 UTC +00:00], ["post_id", 2], ["updated_at", Tue, 01 Apr 2014 18:57:25 UTC +00:00], ["user_id", nil]]