app/views/categories/index.html.erb


  <% current_user_id = User.find_by_id(session[:user_logged_in]).id
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1